%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%          IMU误差模型（随机性误差）
%  输入：
%  t          仿真时间（单位：秒）
%  T          仿真步长（单位：秒）
%  Wibb       机体系陀螺仪输出   （单位：弧度/秒）
%  Fb         机体系加速度计输出 （单位：米/秒/秒）
%  Gyro_b     陀螺随机常数（弧度/秒）
%  Gyro_r     陀螺一阶马尔可夫过程（弧度/秒）
%  Gyro_wg    陀螺白噪声
%  Acc_r      加速度一阶马尔可夫过程（弧度/秒）
%  输出：
%  Wibb       机体系陀螺仪输出   （单位：弧度/秒）
%  Fb         机体系加速度计输出 （单位：米/秒/秒）
%  Gyro_b     陀螺随机常数（弧度/秒）
%  Gyro_r     陀螺一阶马尔可夫过程（弧度/秒）
%  Gyro_wg    陀螺白噪声
%  Acc_r      加速度一阶马尔可夫过程（弧度/秒）
%
%                  熊智            南京航空航天大学导航研究中心编制 2007年04月
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


function [Gyro_b,Gyro_r,Gyro_wg,Acc_r]=imu_err_random(t,T,Gyro_b,Gyro_r,Gyro_wg,Acc_r)

g=9.7803698;         %重力加速度    （单位：米/秒/秒）
Wie=7.292115147e-5;  %地球自转角速度（单位：弧度/秒）
deg_rad=0.01745329252e0;% Transfer from angle degree to rad

Da_bias=[0.001; 0.001; 0.001]*g;  %加速度零偏（应与非随机性误差中的加速度零偏保持一致）

Ta=1800.0; %加速度一阶马尔可夫过程相关时间
Tg=3600.0; %陀螺一阶马尔可夫过程相关时间

%%%%%%%%%%%%%%%%%%随机性误差%%%%%%%%%%%%%%%
if( t==0 )
  Acc_r=Da_bias.*randn(3,1); %加速度一阶马尔可夫过程1.0e-4g
   
  Gyro_b=10*deg_rad/3600.0*randn(3,1); %随机常数0.1(deg/h)
  Gyro_r=10*deg_rad/3600.0*randn(3,1);%陀螺一阶马尔可夫过程0.1(deg/h)
  Gyro_wg=10*deg_rad/3600.0*randn(3,1);%陀螺白噪声0.1(deg/h)
else  
  Acc_wa=sqrt(2*T/Ta)*Da_bias.*randn(3,1);%加速度一阶马尔可夫过程白噪声
  Acc_r=exp(-1.0*T/Ta)*Acc_r+Acc_wa; %加速度一阶马尔可夫过程

  Gyro_wr=sqrt(2*T/Tg)*10*deg_rad/3600.0*randn(3,1);%陀螺一阶马尔可夫过程白噪声0.1(deg/h)
  Gyro_r=exp(-1.0*T/Tg)*Gyro_r+Gyro_wr;%陀螺一阶马尔可夫过程0.1(deg/h)
  Gyro_wg=10*deg_rad/3600.0*randn(3,1);%陀螺白噪声0.1(deg/h)
end 
 

  
 
 
 
 